notebook/blog-2008-01-10-0435.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Getting Things Done: Reading a Book!</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-08-02 19:51:53 EDT"/>
<meta name="author" content="David O'Toole"/>
<meta name="description" content="Getting Things Done: Reading a Book!"/>
<meta name="keywords" content=""/>
<link rel='stylesheet' href="/eon.css" type="text/css"/><link href='http://fonts.googleapis.com/css?family=Ubuntu:regular,italic,bold' rel='stylesheet' type='text/css'/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Getting Things Done: Reading a Book!</h1>

<p>This post is not about <b>Getting Things Done(TM)</b>, but rather about
<i>doing</i> something in particular: reading "Mind and the World Order" by
Clarence Irving Lewis. I mentioned this book on my blog a while back,
when I had only read up through the first chapter. I'm now about
three-quarters finished with the main text, and it's been quite
enjoyable. But this post isn't about the book&mdash;it's about <i>reading</i>
the book, and how I am Getting it Done.
</p>
<p>
This is important to me, because I have a lot of trouble <i>finishing</i>
books. I'll read a few chapters, but then some other book in the room
will catch my eye, and I'll switch.
</p>
<p>
Once I realized this, I decided to put "Mind and the World Order" on
my nightstand, and then <b>removed all other books</b> from the room. Now
the rest of my books are on another floor of the house; when I am in
my bedroom (where most of my reading work is done) there is nothing
else around to read but the book I'm trying to finish. It's worked out
very well, as I'll be finished with MWO in a few days or so.
</p>
</div>

<div id="postamble">
<p class="date">Date: 2011-08-02 19:51:53 EDT</p>
<p class="author">Author: David O'Toole</p>
<p class="creator">Org version 7.7 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
